package game.context;

import game.core.chooseFate.History;
import game.core.chooseFate.Litigation;
import org.springframework.context.annotation.Bean;
import org.springframework.context.annotation.Configuration;

@Configuration
public class HistoryContext {
    @Bean("painter")
    public History getPainter(){
        String personDescription = "Спадкоємець сім'ї Штайманн, перший свого імені, Кернал Штайманн. Студент" +
                " Окреанського університет мистецтв, один з головних ініціаторів зимової виставки картин в" +
                " їхньому родинному замку. Автор 24 картин з цієї самої виставки. Частий гість таверни, в чому" +
                " більшості з нас довелось переконатись на протязі останніх 3 років";

        String faultDescription = "Вчора в дуже піздній час покидаючи таверну з затуманеним світосприйняттям від" +
                " випитого Шнапсу відчинив хвіртку з свинями які належать господярю таверни вирішив влаштувати коріду, " +
                " отримавши чималих наганяїв від свиней, чому може свідчити 3 великі синяки на обличчі. Що призвело до " +
                " втечі останніх в ліс і можливлої появи кабанів через пару років якщо всі свині не будуть спіймані." +
                " Шуриф постановив осудити цю особу на публічне висміювання на стовбі ганьби зі сходу сонця до" +
                " першого придбаного товару на ярмарці.";

        String descPosChoice = "Вас не збентежило те що в колодках заключений спадкоємець знатного роду, тому що якщо б " +
                "сім'я Штайманн не хотіла б допустити публічного висміювання її майбутнього голови, то не допустила б." +
                "Тому ви почали промову: Люди, більшість з вас мала справу з цим поважним родом, і більшість вдячна йому" +
                "за допомогу, але ж чи можемо ми допускати залишати свавілля безкарним ? Вчора він випустив свиней з таверни, " +
                "завтра голубів з пошти, а потім всіх тягових биків. Тому заради майбутнього сім'ї як Штайманн так і " +
                "всієї округи, ми не можемо закрити очі на злочин який може призвести до хаосу та анархії";

        String descNegChoice = "Ви помітили що з краю натовпу стоїть мужчина в поважному віці одягнутив в чорний костюм," +
                " і явними аристократичними рисами поведінки, який уважно слідкував за скупченим натовпом. Ви припустили" +
                " що це може бути хтось з сім'ї Штайманн і почали промову : Люди, більшість з нас ще молоді та гарячі," +
                " якщо не з ззовні то точно в середині. Юнак перший раз оступився в розквіті своєї юності, невже ми " +
                " такі безсердечні що випустимо свій гнів на молодого хлопця яким оступився через недосвічченість в плані " +
                "домашньої худоби. Тим більш що ця худоба так суворо провела з ним виховну бесіду що ми не побачимо " +
                "презентації його картин в таверні ще пару місяці до повного одуження хлопця";

        Litigation litigation = new Litigation(personDescription, faultDescription, descPosChoice, descNegChoice);

        return new History(litigation, "posSequence", "negSequence");
    }
    @Bean("military")
    public History getMilitary(){
        Litigation litigation = new Litigation("personDescription", "faultDesc",
                "descPosChoice", "descNegChoice");

        return new History(litigation, "posSequence", "negSequence");
    }
    @Bean("politician")
    public History getPolitician(){
        Litigation litigation = new Litigation("personDescription", "faultDesc",
                "descPosChoice", "descNegChoice");

        return new History(litigation, "posSequence", "negSequence");
    }
}
