package game.context;

import game.core.chooseFate.History;
import game.core.chooseFate.Litigation;
import org.springframework.context.annotation.Bean;
import org.springframework.context.annotation.Configuration;

@Configuration
public class HistoryContext {
    @Bean("painter")
    public History getPainter(){
        String personDescription = "Спадкоємець сім'ї Штайманн, перший свого імені, Кернал Штайманн. Студент" +
                " Окреанського університет мистецтв, один з головних ініціаторів зимової виставки картин в" +
                " їхньому родинному замку. Автор 24 картин з цієї самої виставки. Частий гість таверни, в чому" +
                " більшості з нас довелось переконатись на протязі останніх 3 років";

        String faultDescription = "Вчора в дуже піздній час покидаючи таверну з затуманеним світосприйняттям від" +
                " випитого Шнапсу відчинив хвіртку з свинями які належать господярю таверни вирішив влаштувати коріду, " +
                " отримавши чималих наганяїв від свиней, чому може свідчити 3 великі синяки на обличчі. Що призвело до " +
                " втечі останніх в ліс і можливлої появи кабанів через пару років якщо всі свині не будуть спіймані." +
                " Шуриф постановив осудити цю особу на публічне висміювання на стовбі ганьби зі сходу сонця до" +
                " першого придбаного товару на ярмарці і відшкодування коштів власнику таверни.";

        String descPosChoice = "Вас не збентежило те що в колодках заключений спадкоємець знатного роду, тому що якщо б " +
                "сім'я Штайманн не хотіла б допустити публічного висміювання її майбутнього голови, то не допустила б." +
                "Тому ви почали промову: Люди, більшість з вас мала справу з цим поважним родом, і більшість вдячна йому" +
                "за допомогу, але ж чи можемо ми допускати залишати свавілля безкарним ? Вчора він випустив свиней з таверни, " +
                "завтра голубів з пошти, а потім всіх тягових биків. Тому заради майбутнього сім'ї як Штайманн так і " +
                "всієї округи, ми не можемо закрити очі на злочин який може призвести до хаосу та анархії";

        String descNegChoice = "Ви помітили що з краю натовпу стоїть мужчина в поважному віці одягнутив в чорний костюм," +
                " і явними аристократичними рисами поведінки, який уважно слідкував за скупченим натовпом. Ви припустили" +
                " що це може бути хтось з сім'ї Штайманн і почали промову : Люди, більшість з нас ще молоді та гарячі," +
                " якщо не з ззовні то точно в середині. Юнак перший раз оступився в розквіті своєї юності, невже ми " +
                " такі безсердечні що випустимо свій гнів на молодого хлопця яким оступився через недосвічченість в плані " +
                "домашньої худоби. Тим більш що ця худоба так суворо провела з ним виховну бесіду що ми не побачимо " +
                "презентації його картин в таверні ще пару місяці до повного одуження хлопця";

        Litigation litigation = new Litigation(personDescription, faultDescription, descPosChoice, descNegChoice);

        String posSequence = "На дворі ранній ранок, а ви бачите великий замок з гербом Штайманн, і на його вході" +
                " статний мужчина середніх років, а поззаду жінка та діти." +
                "Пройшло хвилин 5 і до цього мужчини почали приходити люди з сумними виразами обличчя, але уходили від" +
                "нього вони з псмішкою та надією в очах. І так до пізнього вечора, але уоли двері замку зачинились наніч," +
                "в одному з найбільших вікон можна було почачити що хтось малює на холсті";

        String negSequence = "Пізній вечір, виставка картин але надзвичайно пишна навіть в порівнянні з тими що вам доводилось" +
                "бачити в замку сім'ї Штайманн. І в центрі самого великого залу, де сконцентрувалось найбільше людей" +
                "мужчина з гербом Штайманн на камзолі знімає покривало з холсту, і зривається гул аплодисментів." +
                "Ви підходите ближче і бачмие картину теоретичне існування якої не могли собі уявиди, це не передача " +
                "реальнсті а щось інше, образи на картині не зрозумілі оку, ао=ле ваше сердце окликається на них теплом";

        return new History(litigation, posSequence, negSequence);
    }
    @Bean("military")
    public History getMilitary(){
        String personDescription = "Голова однієї з 3 родів лордів цього краю Камаель Саргас. Ветерат війни королівст," +
                "герой Парузької бойні і голова свого роду.";

        String faultDescription = "Вчора ввечері охотячись в своїх угіддях, через кураж погоні зайшов на територію" +
                "нашого ліссу і підпалив її. В результаті загиблих окрім дерев немає, замість половини лісу попелище." +
                "Шериф виніс покарання 1 годину на стовбі ганьби і відшкодування коштів місту";

        String descPosChoice = "Люди, я думаю більшість вас має або мала рідних в Парубі, і ми всі чули про кривайу бойню" +
                "спричинену цими псами війни які йдуть лише за блиском золота, а їхня вірність вимірюється в монетах. І " +
                "ось коли така людина повертається додому, і їй не вистачає того запалу і ейфорії від бойових дії і " +
                "вона почне шукати заміну наприклад вчорашнє полювання в горящому лісі чи можливе завтрашня стрільба " +
                "по скоту. Але межі ейфоріх, немає тому якщо ми псилаючих на його кроваві заслуги на війні забудемо" +
                " про цей інцидент, лише розпалимо з вогнище хаосу яке зупинити нам не стане сил";

        String descNegChoice = "Помітивши що сер Саргас одягнений лише в чорне і що з відкритого карману видно фотографію" +
                " ви згадали що в нього був син, але про нього ні згадав глашатай ні було видно на площі і" +
                " пітверджував ваші думки пустий погляд лорда, надто знайомий для того хто атратив близьку людину. " +
                " Ви почали промову: О щасливий, процвітаючий, незнаючий горя та війни народ, думаю в доброї половини" +
                " нашого міста є родичі чи були рідні в Парубі, війна це кров та смерть, і захистити нас від неї можуть" +
                "лише ті хто готовий витерпіти їх. Лорд Я впевнений що лорд саргас відтав чимало на тій війні, щоб" +
                "вона не дісталась околиць, чи ми можемо забути про його жертви через маленький оступ мпричинений " +
                "в пориві втрати близької людини ?";

        Litigation litigation = new Litigation(personDescription, faultDescription, descPosChoice, descNegChoice);

        String posSequence = "На дворі вечір і перед собою ви бачите поле бою після стички двух армі, і серед безлічі" +
                "тіл та диму в середині цієї бойні зійшлись в дуелі на шпагах 2 мужчин.Перший кремезний чоловяга," +
                "а інший явно старше його свого суперника років на 20 з шляпою на якій було вишито ініціали К.С але" +
                " з всіма своїми рухами показував бажання знищитисупротивника за будь яку ціну. Ось коли вже стичка досягала" +
                "свого апогея кремезний молодик парирував удар і без сумніввів проткнув свого суперника і в шляпі " +
                "залишився так і не вийшов з цього поля битви";

        String negSequence = "Ви опинились на порозі бараків схожі на воєнні але надзвичайно чисті та охайні," +
                "і біля них навіть до сходу сонця вже стояло безліч людей в однаковий обладунках і зі зброєю" +
                "виконуваших вправи зі штиком на мушкеті. Видовище було не з звичайних, бо зазвичай воєнні це найомний" +
                "зброд з дисципліною на рівні якщо зарплата затримаєтся хоч на день з наших складів почне щось пропадати." +
                "А тут всі охайні підтянуті і виконують абсолютно все що скаже людина яка стоїть перед ними. Їхнім головним" +
                "був повністю сідий мужчина але його старість видавало лише обличчя вкрите шрамами і сива голова, " +
                "але рухався він не гірше ніж всі інші даючи їм приклад і підсказуючи що не так ";

        return new History(litigation, posSequence, negSequence);
    }
    @Bean("politician")
    public History getPolitician(){
        String personDescription = "Зі слів закутого в колодки без іменний іноземець";

        String faultDescription = "Посмів нагрубити дружині нашого всіма поважаємого шерифа. Любий мужчина почувший " +
                "образу в сторону своєї дружини зробить все щоб це не зійшло з рук винуватцю, тому 1 години" +
                "на стовбі ганьби має вистачити щоб спокутувати провину перед місіс Штайлау";

        String descPosChoice = "Люди подивіться на нього таких здорованів в нащих краях ніколи не водилось. Тоді це що " +
                "виходить ? Спочатку іноземці чіпляються до наших жінок, забирають у нас роботу, а що потім ? Виженуть" +
                "з власної оселі. Та не буде цього поки я стою твердо на цій землі" ;

        String descNegChoice = "Неважко було в цій толпі побачити жінку шерифа з надзвичайно обуреним лицем жадаючим" +
                "відплати, але її чоловіка ніде не було видно. І подивившис людину в колодках ви помітили 2 незвичні речі" +
                "пеша що це був іноземець а інша що було незвично для тих хто був закутий в кандали на площі він надзвичайно" +
                "сильно хвилювався але явн не через натовп а немовби боявся що його впізнають намагаючий знайти когось" +
                "бузуспішно очима в натовпі. І ви почали промову: шановна місіс Штайлау я розумію що ви обурені діями" +
                "цього безумовно злочинця в ваших очах, але я думаю що серед присутніх немає знайомих цього юнака і це " +
                "про це і його наряд і зріст свідчать що він явно не з цих країв, а осуджувати людину через те що він" +
                "погано говорить на нашій мові і випадково нагрубив я вважаю неправильно, так як не шанувати гостя в своєму" +
                "домі великий гріх, а хто він як не гість в нашій окрузі ? Тому пропоную запросити перекладача та" +
                "уладити цей конфлікт вам з вашим чоловікам за гарною вечерею яку проспонсорую цей без сумнівів, судячі по його" +
                "одежі заможний юнак";

        Litigation litigation = new Litigation(personDescription, faultDescription, descPosChoice, descNegChoice);

        String posSequence = "Ви закінчили свою промову і тут коли перша хвиля овочів та фруктів" +
                "полетіла в хлопчину закутого в кайдани, ви почули звук скла який розбився і різко" +
                " зміна місця цей самий хлопчина лежить на ліжку блідий як постіль і " +
                "ще раз зміна місця, зазвичай ваші сни йдуть плано але це більше схоже на кошмар, палаюче місто" +
                "далекої країни де корлівські воєнні творяьб все такі злодіянні якими навіть пропагандисти вас нелякали" +
                "на передодні минулої війни між королівствами. Ще один перехід і ви бачите лише попелище " +
                "замість міста в вогні." ;

        String negSequence = "Ясний день, перед вами ціле місто з висоти пташиного льоту. Але немов очима гостозорого " +
                "птаха ви стані побачити найдрібніші деталі такі як написи на муленьких затишних вивісках на вулицях" +
                "явно не бачений вами нині одяг дітей що ганяють по центальній площі. Але вся ваша увага прикута до великого" +
                "та красивого будинку на місці якого безперечно мав би стояти королівський палац. Туди по черзі заходять" +
                "люди схожі більше на торгівців ніж на графів чи придворних радниців. Через вікно видно в самому центрі " +
                "людину яка намагається керувати балаганом спричиненим купою цих людей мужчина надзвичайно високий навіть" +
                "для жителів цієї країни.";

        return new History(litigation, posSequence, negSequence);
    }
}
