package game.context;

import game.core.chooseFate.History;
import game.core.chooseFate.Litigation;
import org.springframework.context.annotation.Bean;
import org.springframework.context.annotation.Configuration;

@Configuration
public class HistoryContext {
    @Bean
    public History Painter(){
        String personDescription = "Спадкоємець сім'ї Штайманн, перший свого імені, Кернал Штайманн. Студент\n" +
                " Окреанського університет мистецтв, один з головних ініціаторів зимової виставки картин в\n" +
                " їхньому родинному замку. Автор 24 картин з цієї самої виставки. Частий гість таверни, в чому\n" +
                " більшості з нас довелось переконатись на протязі останніх 3 років\n";

        String faultDescription = "Вчора в дуже піздній час покидаючи таверну з затуманеним світосприйняттям від\n" +
                " випитого Шнапсу відчинив хвіртку з свинями які належать господярю таверни вирішив влаштувати коріду, \n" +
                " отримавши чималих наганяїв від свиней, чому може свідчити 3 великі синяки на обличчі. Що призвело до \n" +
                " втечі останніх в ліс і можливлої появи кабанів через пару років якщо всі свині не будуть спіймані.\n" +
                " Шуриф постановив осудити цю особу на публічне висміювання на стовбі ганьби зі сходу сонця до\n" +
                " першого придбаного товару на ярмарці і відшкодування коштів власнику таверни.\n";

        String descPosChoice = "Вас не збентежило те що в колодках заключений спадкоємець знатного роду, тому що якщо б \n" +
                "сім'я Штайманн не хотіла б допустити публічного висміювання її майбутнього голови, то не допустила б.\n" +
                "Тому ви почали промову: Люди, більшість з вас мала справу з цим поважним родом, і більшість вдячна йому\n" +
                "за допомогу, але ж чи можемо ми допускати залишати свавілля безкарним ? Вчора він випустив свиней з таверни,\n " +
                "завтра голубів з пошти, а потім всіх тягових биків. Тому заради майбутнього сім'ї як Штайманн так і\n " +
                "всієї округи, ми не можемо закрити очі на злочин який може призвести до хаосу та анархії\n";

        String descNegChoice = "Ви помітили що з краю натовпу стоїть мужчина в поважному віці одягнутив в чорний костюм,\n" +
                " і явними аристократичними рисами поведінки, який уважно слідкував за скупченим натовпом. Ви припустили\n" +
                " що це може бути хтось з сім'ї Штайманн і почали промову : Люди, більшість з нас ще молоді та гарячі,\n" +
                " якщо не з ззовні то точно в середині. Юнак перший раз оступився в розквіті своєї юності, невже ми \n" +
                " такі безсердечні що випустимо свій гнів на молодого хлопця яким оступився через недосвічченість в плані \n" +
                "домашньої худоби. Тим більш що ця худоба так суворо провела з ним виховну бесіду що ми не побачимо\n " +
                "презентації його картин в таверні ще пару місяці до повного одуження хлопця";

        Litigation litigation = new Litigation(personDescription, faultDescription, descPosChoice, descNegChoice);

        String posSequence = "На дворі ранній ранок, а ви бачите великий замок з гербом Штайманн, і на його вході\n" +
                " статний мужчина середніх років, а поззаду жінка та діти.\n" +
                "Пройшло хвилин 5 і до цього мужчини почали приходити люди з сумними виразами обличчя, але уходили від\n" +
                "нього вони з псмішкою та надією в очах. І так до пізнього вечора, але уоли двері замку зачинились наніч,\n" +
                "в одному з найбільших вікон можна було почачити що хтось малює на холсті";

        String negSequence = "Пізній вечір, виставка картин але надзвичайно пишна навіть в порівнянні з тими що вам доводилось\n" +
                "бачити в замку сім'ї Штайманн. І в центрі самого великого залу, де сконцентрувалось найбільше людей\n" +
                "мужчина з гербом Штайманн на камзолі знімає покривало з холсту, і зривається гул аплодисментів.\n" +
                "Ви підходите ближче і бачмие картину теоретичне існування якої не могли собі уявиди, це не передача\n " +
                "реальнсті а щось інше, образи на картині не зрозумілі оку, ао=ле ваше сердце окликається на них теплом\n";

        return new History(litigation, posSequence, negSequence);
    }
    @Bean
    public History Military(){
        String personDescription = "Голова однієї з 3 родів лордів цього краю Камаель Саргас. Ветерат війни королівст,\n" +
                "герой Парузької бойні і голова свого роду.";

        String faultDescription = "Вчора ввечері охотячись в своїх угіддях, через кураж погоні зайшов на територію\n" +
                "нашого ліссу і підпалив її. В результаті загиблих окрім дерев немає, замість половини лісу попелище.\n" +
                "Шериф виніс покарання 1 годину на стовбі ганьби і відшкодування коштів місту";

        String descPosChoice = "Люди, я думаю більшість вас має або мала рідних в Парубі, і ми всі чули про кривайу бойню\n" +
                "спричинену цими псами війни які йдуть лише за блиском золота, а їхня вірність вимірюється в монетах. І \n" +
                "ось коли така людина повертається додому, і їй не вистачає того запалу і ейфорії від бойових дії і \n" +
                "вона почне шукати заміну наприклад вчорашнє полювання в горящому лісі чи можливе завтрашня стрільба \n" +
                "по скоту. Але межі ейфоріх, немає тому якщо ми псилаючих на його кроваві заслуги на війні забудемо\n" +
                " про цей інцидент, лише розпалимо з вогнище хаосу яке зупинити нам не стане сил";

        String descNegChoice = "Помітивши що сер Саргас одягнений лише в чорне і що з відкритого карману видно фотографію\n" +
                " ви згадали що в нього був син, але про нього ні згадав глашатай ні було видно на площі і\n" +
                " пітверджував ваші думки пустий погляд лорда, надто знайомий для того хто атратив близьку людину.\n " +
                " Ви почали промову: О щасливий, процвітаючий, незнаючий горя та війни народ, думаю в доброї половини\n" +
                " нашого міста є родичі чи були рідні в Парубі, війна це кров та смерть, і захистити нас від неї можуть\n" +
                "лише ті хто готовий витерпіти їх. Лорд Я впевнений що лорд саргас відтав чимало на тій війні, щоб\n" +
                "вона не дісталась околиць, чи ми можемо забути про його жертви через маленький оступ мпричинений \n" +
                "в пориві втрати близької людини ?";

        Litigation litigation = new Litigation(personDescription, faultDescription, descPosChoice, descNegChoice);

        String posSequence = "На дворі вечір і перед собою ви бачите поле бою після стички двух армі, і серед безлічі\n" +
                "тіл та диму в середині цієї бойні зійшлись в дуелі на шпагах 2 мужчин.Перший кремезний чоловяга,\n" +
                "а інший явно старше його свого суперника років на 20 з шляпою на якій було вишито ініціали К.С але\n" +
                " з всіма своїми рухами показував бажання знищитисупротивника за будь яку ціну. Ось коли вже стичка досягала\n" +
                "свого апогея кремезний молодик парирував удар і без сумніввів проткнув свого суперника і в шляпі\n " +
                "залишився так і не вийшов з цього поля битви";

        String negSequence = "Ви опинились на порозі бараків схожі на воєнні але надзвичайно чисті та охайні,\n" +
                "і біля них навіть до сходу сонця вже стояло безліч людей в однаковий обладунках і зі зброєю\n" +
                "виконуваших вправи зі штиком на мушкеті. Видовище було не з звичайних, бо зазвичай воєнні це найомний\n" +
                "зброд з дисципліною на рівні якщо зарплата затримаєтся хоч на день з наших складів почне щось пропадати.\n" +
                "А тут всі охайні підтянуті і виконують абсолютно все що скаже людина яка стоїть перед ними. Їхнім головним\n" +
                "був повністю сідий мужчина але його старість видавало лише обличчя вкрите шрамами і сива голова, \n" +
                "але рухався він не гірше ніж всі інші даючи їм приклад і підсказуючи що не так ";

        return new History(litigation, posSequence, negSequence);
    }
    @Bean
    public History Politician(){
        String personDescription = "Зі слів закутого в колодки без іменний іноземець\n";

        String faultDescription = "Посмів нагрубити дружині нашого всіма поважаємого шерифа. Любий мужчина почувший \n" +
                "образу в сторону своєї дружини зробить все щоб це не зійшло з рук винуватцю, тому 1 години\n" +
                "на стовбі ганьби має вистачити щоб спокутувати провину перед місіс Штайлау";

        String descPosChoice = "Люди подивіться на нього таких здорованів в нащих краях ніколи не водилось. Тоді це що \n" +
                "виходить ? Спочатку іноземці чіпляються до наших жінок, забирають у нас роботу, а що потім ? Виженуть\n" +
                "з власної оселі. Та не буде цього поки я стою твердо на цій землі" ;

        String descNegChoice = "Неважко було в цій толпі побачити жінку шерифа з надзвичайно обуреним лицем жадаючим\n" +
                "відплати, але її чоловіка ніде не було видно. І подивившис людину в колодках ви помітили 2 незвичні речі\n" +
                "пеша що це був іноземець а інша що було незвично для тих хто був закутий в кандали на площі він надзвичайно\n" +
                "сильно хвилювався але явн не через натовп а немовби боявся що його впізнають намагаючий знайти когось\n" +
                "бузуспішно очима в натовпі. І ви почали промову: шановна місіс Штайлау я розумію що ви обурені діями\n" +
                "цього безумовно злочинця в ваших очах, але я думаю що серед присутніх немає знайомих цього юнака і це \n" +
                "про це і його наряд і зріст свідчать що він явно не з цих країв, а осуджувати людину через те що він\n" +
                "погано говорить на нашій мові і випадково нагрубив я вважаю неправильно, так як не шанувати гостя в своєму\n" +
                "домі великий гріх, а хто він як не гість в нашій окрузі ? Тому пропоную запросити перекладача та\n" +
                "уладити цей конфлікт вам з вашим чоловікам за гарною вечерею яку проспонсорую цей без сумнівів, судячі по його\n" +
                "одежі заможний юнак";

        Litigation litigation = new Litigation(personDescription, faultDescription, descPosChoice, descNegChoice);

        String posSequence = "Ви закінчили свою промову і тут коли перша хвиля овочів та фруктів\n" +
                "полетіла в хлопчину закутого в кайдани, ви почули звук скла який розбився і різко\n" +
                " зміна місця цей самий хлопчина лежить на ліжку блідий як постіль і \n" +
                "ще раз зміна місця, зазвичай ваші сни йдуть плано але це більше схоже на кошмар, палаюче місто\n" +
                "далекої країни де корлівські воєнні творяьб все такі злодіянні якими навіть пропагандисти вас нелякали\n" +
                "на передодні минулої війни між королівствами. Ще один перехід і ви бачите лише попелище \n" +
                "замість міста в вогні." ;

        String negSequence = "Ясний день, перед вами ціле місто з висоти пташиного льоту. Але немов очима гостозорого \n" +
                "птаха ви стані побачити найдрібніші деталі такі як написи на муленьких затишних вивісках на вулицях\n" +
                "явно не бачений вами нині одяг дітей що ганяють по центальній площі. Але вся ваша увага прикута до великого\n" +
                "та красивого будинку на місці якого безперечно мав би стояти королівський палац. Туди по черзі заходять\n" +
                "люди схожі більше на торгівців ніж на графів чи придворних радниців. Через вікно видно в самому центрі \n" +
                "людину яка намагається керувати балаганом спричиненим купою цих людей мужчина надзвичайно високий навіть\n" +
                "для жителів цієї країни.";

        return new History(litigation, posSequence, negSequence);
    }
}
